# St7GetLastOpenFileCode

Returns the error code generated by the last call to St7OpenFile or St7OpenFileReadOnly.

long St7GetLastOpenFileCode()
The function returns a long integer packed with logical bit flags at the following addresses:
[ibFileNameTooLongOrInvalid] – File name is too long or contains invalid characters.
[ibFileSharingError] – File is locked by another process.
[ibFileCantRead] – File could not be read.
[ibFileNotFound] – File could not be found.
[ibFileInvalidData] – File contains invalid data.
[ibFileTruncated] – File length is less than expected.
[ibFileIsBXS] – File is a BXS file.
[ibFileIsNotSt7] – File is not an ST7 file.
[ibInsufficientFreeSpace] – Insufficient free space in ScratchPath location to create file cache.